# Задача-1:
# Напишите скрипт, создающий директории dir_1 - dir_9 в папке,
# из которой запущен данный скрипт.
# И второй скрипт, удаляющий эти папки.

# 1:
print("1st part:")

import os


# Задача-2:
# Напишите скрипт, отображающий папки текущей директории.
# 2
print("2nd part:")

directories = os.listdir()
print(directories)

# Задача-3:
# Напишите скрипт, создающий копию файла, из которого запущен данный скрипт.

